# Line Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Line Class
Members See Also
---
A line in space.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Line : Curve
```

Visual Basic
---
```text
Public Class Line _
	Inherits Curve
```

Visual C++
---
```text
public ref class Line : public Curve
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..GeometryObject Autodesk.Revit.DB..::..Curve Autodesk.Revit.DB..::..Line
# See Also
Line Members
Autodesk.Revit.DB Namespace